import React, { useContext } from 'react';
import { Offers } from '../../utils/Offers/Offers';
import c from './AboutUs.module.scss';
import { Catalog } from '../../utils/Catalog/Catalog';
import { Tree } from '../../utils/Tree/Tree';
import { StateContext } from '../../../context/context';
export const AboutUs = () => {
  const { state1 } = useContext(StateContext);
  return (
    <div>
      <div className={c.container}>
        <div className={c.tree}>
          <Tree title="О нас" />
        </div>
        <div className={c.main}>
          <div className={c.catalog}>
            <Catalog />
          </div>
          <div className={c.text}>
            <h2 className={c.title}>Компанія “Divan”</h2>
            <div className={c.block}>
              <h3 className={c.subtitle}>{`М'які меблі для всієї родини`}</h3>
              <span>
                {`Підшукуєте добротні м'які меблі, які прикрашатимуть ваш будинок
                і створюватимуть у ньому атмосферу затишку? Хочете купити зручне
                велике ліжко або гарний диван з кріслами у вітальню? Приходьте
                до нас, фабрика «Divan» – надійний український виробник, який
                випускає красиві та довговічні меблі, якість яких підтверджена
                сертифікатами.`}
              </span>
              <br />
              <span>
                {`Вже понад 20 років фабрика займає почесне місце серед кращих
                українських виробників, пропонуючи покупцям не тільки
                виготовлення м'яких меблів на замовлення, а й готові м'які меблі
                власного виробництва з доставкою по регіонах – Київ та Україна.`}
              </span>
            </div>
            <div className={c.block}>
              <h3 className={c.subtitle}>
                Надійні механізми для частого розкладання
              </h3>
              <span>
                {`Якщо ви вирішили купити диван для повсякденного сну, обов'язково
                зверніть увагу на механізм трансформації. Він повинен бути
                надійним і простим в експлуатації, щоб часте розкладання дивана
                не перетворилося для вас на муки.`}
              </span>
              <br />
              <span>
                {`В основі диванів найпрактичніші механізми трансформації,
                перевірені роками експлуатації та заслужили довіру наших
                клієнтів. Серед них класичні механізми: єврокнижка, Пантограф і
                викочування, а також більш незвичайні, але не менш зручні
                механізми - поворотний, Дельфін і наш унікальний механізм Мааян.
                Кожен механізм відрізняється способом розкладки та підходить для
                різних цілей. Наприклад, для щоденного сну найкраще підійде
                диван із механізмом єврокнижка або Пантограф. В основі
                мініатюрного дивана-малютки, а також для гостьових диванів
                частіше використовується механізм викочування трансформації або
                Дельфін. А для складніших і нестандартніших рішень є поворотний
                механізм і Мааян. Ми пропонуємо різні варіанти, але вибір завжди
                за вами.`}
              </span>
            </div>
            <div className={c.block}>
              <h3 className={c.subtitle}>
                Ліжка з підйомною «спинкою» матраца
              </h3>
              <span>
                {`По-перше, у наших ліжок є суперздатність – підйомна «спинка»
                матраца. Спинка може підніматися за допомогою механічного або
                електричного підйомного механізму.`}
              </span>
              <br />
              <span>
                {`У випадку з механічним витягом вам доведеться вставати з ліжка,
                щоб відрегулювати кут нахилу спинки (всього таких рівнів 11). В
                той час, як електричний підйомний механізм дозволить вам
                залишатися в ліжку та піднімати/опускати спинку натисканням
                кнопки пульта управління. Така опція підйому «спинки» підійде
                всім, хто любить працювати в ліжку з ноутбуком, дивитися серіали
                або читати. А для людей, які проводять багато часу в ліжку за
                станом здоров'я, можливість піднімати та опускати «спинку»
                буде просто незамінною.`}
              </span>
              <br />
              <span>
                По-друге, ви можете підібрати розмір спального місця та вибрати
                вбудований ортопедичний матрац для будь-якої моделі наших ліжок
                (крім ліжок Box Spring). Зверніть увагу, що всі наші ліжка
                продаються відразу із вбудованим матрацом (ми не продаємо ліжко
                окремо від матраца). сертифікатами.
              </span>
            </div>
          </div>
        </div>
      </div>
      <Offers product={state1.product} type="new" title="Нові моделі" />
      <Offers
        product={state1.product}
        type="popular"
        title="Популярні моделі"
      />
    </div>
  );
};
